2.2.013/src/Catalogs/МК_ВидыДокументовМояКоманда/МК_ВидыДокументовМояКоманда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ВидыДокументовМояКоманда</name>
  <comment>Копия справочника из облака</comment>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМинтруда</name>
    <type>
      <types>CatalogRef.КодыДокументовКадровыхМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Опубликован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/Catalogs/МК_ВидыДокументовМояКоманда/ManagerModule.bsl
Функция ОбновитьВидыДокументовМКНаСервере()    Экспорт
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина); 
	мСправ = Новый Массив;
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 
		// Первый справочник - копия из МояКоманда
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/edms/document-types-list", мСеанс);    
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("GET", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			Если ТипЗнч(СтрОтвет) <> Тип("Структура")ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная  
			Иначе     
				мСправ = СтрОтвет.Data.Items;	
			КонецЕсли;	
		Исключение   
			мОшибка = "Ошибка получения справочника. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;
		КонецПопытки;       
		Если мСправ.Количество() >0 Тогда   
			мРезультат = ЗаполнитьСправочник(мСправ);
		КонецЕсли;		
	КонецЕсли;	
КонецФункции	

Функция ЗаполнитьСправочник(мСправ) Экспорт
	Для Каждого мЭлемент Из мСправ Цикл
		мКод = Строка(мЭлемент.ID);
		мДокСсылка = Справочники.МК_ВидыДокументовМояКоманда.НайтиПоРеквизиту("ID", мКод);
		Если Не мДокСсылка.Пустая() Тогда   
			мДок = мДокСсылка.ПолучитьОбъект();
		Иначе     
			мДок = Справочники.МК_ВидыДокументовМояКоманда.СоздатьЭлемент();
			мДок.ID = мКод;
		КонецЕсли;
		мДок.Наименование = мЭлемент.name;
		мДок.Базовый = мЭлемент.is_default;
		мДок.Опубликован = мЭлемент.is_show;
		мКод = мЭлемент.classifier_code;   // Это строка. А нам нужна ссылка
		мКМТ = Справочники.КодыДокументовКадровыхМероприятий.НайтиПоКоду(мКод);
		мДок.КодМинтруда = мКМТ;
		мДок.Записать();
	КонецЦикла;	
КонецФункции
